     A          R CABREC                 PFILE(CABMAST)
     A          K AVAIL
     A          K CABID
     A          S AVAIL                  COMP(EQ 'Y')
