H DFTACTGRP(*NO)
     H ACTGRP(*CALLER)

*------------------------------------------------------------------
* Files
*------------------------------------------------------------------
     FEMPLFMGRUPD UF   E           K DISK

*------------------------------------------------------------------
* Parameters
*------------------------------------------------------------------
     D EMPUPDC         PI
     D  PEMPID                       6P 0

*------------------------------------------------------------------
* Work Fields
*------------------------------------------------------------------
     D VALID           S              1A

*------------------------------------------------------------------
* Fetch Record
*------------------------------------------------------------------
     C                   CHAIN     PEMPID        EMPREC
     C                   IF        %NOTFOUND
     C                   RETURN
     C                   ENDIF

*------------------------------------------------------------------
* Load to Display
*------------------------------------------------------------------
     C                   EVAL      DSP_EMP   = EMPID
     C                   EVAL      DSP_NAME  = EMPNAME
     C                   EVAL      DSP_ADDR  = ADDRESS
     C                   EVAL      DSP_PHONE = PHONE
     C                   EVAL      DSP_STAT  = STATUS

*------------------------------------------------------------------
* Display Window
*------------------------------------------------------------------
     C                   EXFMT     EMPUPDW

     C                   IF        *IN12 = *ON
     C                   RETURN
     C                   ENDIF

*------------------------------------------------------------------
* Validation
*------------------------------------------------------------------
     C                   IF        DSP_STAT = 'Y'
     C                   OR        DSP_STAT = 'N'
     C                   EVAL      VALID = 'Y'
     C                   ELSE
     C                   EVAL      VALID = 'N'
     C                   ENDIF

*------------------------------------------------------------------
* Update Record
*------------------------------------------------------------------
     C                   IF        VALID = 'Y'
     C                   EVAL      EMPNAME = DSP_NAME
     C                   EVAL      ADDRESS = DSP_ADDR
     C                   EVAL      PHONE   = DSP_PHONE
     C                   EVAL      STATUS  = DSP_STAT
     C                   UPDATE    EMPREC
     C                   ENDIF

     C                   RETURN
