**FREE
ctl-opt dftactgrp(*NO) actgrp(*NEW);

dcl-f ITEMS usage(*update) keyed;
dcl-f IMPCSV  disk usage(*input)
        organization(*streamfile)
        path('/tmp/itemsload.csv')
        lrecl(300) open(*read);

dcl-s line varchar(300);

importCSV();
*inlr = *on;

dcl-proc importCSV;
  dcl-ds Data;
     idc char(5);
     name char(40);
     qtyc char(10);
  end-ds;

  dcl-s p1 int(10);
  dcl-s p2 int(10);

  read IMPCSV line;
  dow not %eof(IMPCSV);

    p1 = %scan(',' : line);
    p2 = %scan(',' : line : p1+1);
    idc  = %trim(%subst(line:1:p1-1));
    name = %trim(%subst(line:p1+1:p2-p1-1));
    qtyc = %trim(%subst(line:p2+1));

    ITEMID = %dec(idc:5:0);
    ITEMNAME = name;
    QTYONHAND = %dec(qtyc:9:0);

    chain ITEMID ITEMS;
    if %found;
      update ITEMS;
    else;
      write ITEMS;
    endif;

    read IMPCSV line;
  enddo;
End-proc;
