**FREE
ctl-opt dftactgrp(*NO) actgrp(*NEW);

dcl-f ITEMDSP1 workstn;
dcl-f ITEMS    keyed usage(*input);
dcl-f ITEMPRT1 printer(132);

dcl-s cnt packed(3:0);

// Display title screen
write MAINREC1;

// Count items
cnt = %elem(ITEMS);

// Print header
write ITEMHEAD;

// Loop through file
read ITEMS;
dow not %eof(ITEMS);
   ITMID   = ITEMID;
   ITMNAME = ITEMNAME;
   ITMQTY  = QTYONHAND;

   write ITEMDET;
   read ITEMS;
enddo;

// Summary
LINECOUNT = cnt;
update MAINREC1;

*inlr = *on;
return;
